test_result/fio-3.28-4R5J0001-sr-1G-qd4-num1-16K-3000-WT.txt
fio-3.28-4R5J0001-read-1G-4-1-16K: (g=0): rw=read, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=4
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685860,
  "timestamp_ms" : 1750685860814,
  "time" : "Mon Jun 23 21:37:40 2025",
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-read-1G-4-1-16K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 3,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-read-1G-4-1-16K",
        "filename" : "/dev/sda",
        "rw" : "read",
        "bs" : "16K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "4",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 540111581,
        "bw" : 527452,
        "iops" : 32965.794769,
        "runtime" : 1988,
        "total_ios" : 65536,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 2836,
          "max" : 57641,
          "mean" : 11180.165558,
          "stddev" : 3947.575002,
          "N" : 65536
        },
        "clat_ns" : {
          "min" : 34831,
          "max" : 400521,
          "mean" : 108579.926880,
          "stddev" : 39669.681014,
          "N" : 65536,
          "percentile" : {
            "1.000000" : 54528,
            "5.000000" : 57600,
            "10.000000" : 59648,
            "20.000000" : 67072,
            "30.000000" : 92672,
            "40.000000" : 110080,
            "50.000000" : 112128,
            "60.000000" : 116224,
            "70.000000" : 121344,
            "80.000000" : 129536,
            "90.000000" : 136192,
            "95.000000" : 144384,
            "99.000000" : 268288,
            "99.500000" : 280576,
            "99.900000" : 296960,
            "99.950000" : 296960,
            "99.990000" : 313344
          },
          "bins" : {
            "35072" : 1,
            "43776" : 1,
            "44288" : 2,
            "44800" : 1,
            "45312" : 1,
            "45824" : 4,
            "46336" : 27,
            "46848" : 35,
            "47360" : 24,
            "47872" : 28,
            "48384" : 17,
            "48896" : 4,
            "49408" : 6,
            "49920" : 9,
            "50432" : 33,
            "50944" : 45,
            "51456" : 77,
            "51968" : 77,
            "52480" : 56,
            "52992" : 58,
            "53504" : 72,
            "54016" : 71,
            "54528" : 100,
            "55040" : 450,
            "55552" : 777,
            "56064" : 468,
            "56576" : 278,
            "57088" : 275,
            "57600" : 507,
            "58112" : 1236,
            "58624" : 913,
            "59136" : 683,
            "59648" : 629,
            "60160" : 420,
            "60672" : 340,
            "61184" : 356,
            "61696" : 588,
            "62208" : 493,
            "62720" : 289,
            "63232" : 470,
            "63744" : 607,
            "64256" : 623,
            "64768" : 432,
            "65280" : 235,
            "66048" : 578,
            "67072" : 788,
            "68096" : 1602,
            "69120" : 1431,
            "70144" : 398,
            "71168" : 167,
            "72192" : 180,
            "73216" : 254,
            "74240" : 259,
            "75264" : 195,
            "76288" : 137,
            "77312" : 114,
            "78336" : 134,
            "79360" : 257,
            "80384" : 191,
            "81408" : 130,
            "82432" : 92,
            "83456" : 64,
            "84480" : 56,
            "85504" : 133,
            "86528" : 305,
            "87552" : 107,
            "88576" : 82,
            "89600" : 47,
            "90624" : 55,
            "91648" : 81,
            "92672" : 81,
            "93696" : 67,
            "94720" : 29,
            "95744" : 32,
            "96768" : 30,
            "97792" : 35,
            "98816" : 40,
            "99840" : 21,
            "100864" : 39,
            "101888" : 90,
            "102912" : 199,
            "103936" : 307,
            "104960" : 435,
            "105984" : 577,
            "107008" : 634,
            "108032" : 709,
            "109056" : 1084,
            "110080" : 2402,
            "111104" : 3506,
            "112128" : 3668,
            "113152" : 2478,
            "114176" : 1339,
            "115200" : 1101,
            "116224" : 2004,
            "117248" : 1827,
            "118272" : 1578,
            "119296" : 704,
            "120320" : 876,
            "121344" : 841,
            "122368" : 527,
            "123392" : 498,
            "124416" : 346,
            "125440" : 468,
            "126464" : 596,
            "127488" : 598,
            "128512" : 1144,
            "129536" : 2269,
            "130560" : 2207,
            "132096" : 2172,
            "134144" : 1366,
            "136192" : 2166,
            "138240" : 842,
            "140288" : 402,
            "142336" : 239,
            "144384" : 168,
            "146432" : 108,
            "148480" : 99,
            "150528" : 114,
            "152576" : 69,
            "154624" : 43,
            "156672" : 56,
            "158720" : 58,
            "160768" : 56,
            "162816" : 47,
            "164864" : 34,
            "166912" : 38,
            "168960" : 12,
            "171008" : 22,
            "173056" : 4,
            "175104" : 6,
            "177152" : 10,
            "179200" : 3,
            "181248" : 7,
            "183296" : 6,
            "185344" : 10,
            "187392" : 11,
            "189440" : 3,
            "191488" : 7,
            "195584" : 3,
            "197632" : 2,
            "199680" : 2,
            "201728" : 2,
            "203776" : 2,
            "205824" : 3,
            "207872" : 4,
            "209920" : 23,
            "211968" : 38,
            "214016" : 34,
            "216064" : 20,
            "218112" : 23,
            "220160" : 71,
            "222208" : 45,
            "224256" : 24,
            "226304" : 14,
            "228352" : 24,
            "230400" : 19,
            "232448" : 17,
            "234496" : 14,
            "236544" : 21,
            "238592" : 32,
            "240640" : 35,
            "242688" : 23,
            "244736" : 28,
            "246784" : 41,
            "248832" : 106,
            "250880" : 164,
            "252928" : 153,
            "254976" : 92,
            "257024" : 117,
            "259072" : 214,
            "261120" : 132,
            "264192" : 101,
            "268288" : 101,
            "272384" : 90,
            "276480" : 81,
            "280576" : 92,
            "284672" : 71,
            "288768" : 81,
            "292864" : 83,
            "296960" : 44,
            "301056" : 11,
            "305152" : 4,
            "309248" : 7,
            "313344" : 3,
            "317440" : 1,
            "321536" : 1,
            "354304" : 1,
            "395264" : 2,
            "399360" : 1
          }
        },
        "lat_ns" : {
          "min" : 53947,
          "max" : 408715,
          "mean" : 120074.799149,
          "stddev" : 39849.948702,
          "N" : 65536
        },
        "bw_min" : 499840,
        "bw_max" : 542464,
        "bw_agg" : 99.567788,
        "bw_mean" : 525173.333333,
        "bw_dev" : 22421.300349,
        "bw_samples" : 3,
        "iops_min" : 31240,
        "iops_max" : 33904,
        "iops_mean" : 32823.333333,
        "iops_stddev" : 1401.331272,
        "iops_samples" : 3
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 1987,
      "usr_cpu" : 9.813790,
      "sys_cpu" : 48.012079,
      "ctx" : 23814,
      "majf" : 0,
      "minf" : 27,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 99.995422,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.241089,
        "100" : 30.247498,
        "250" : 67.028809,
        "500" : 2.482605,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 4,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 62112,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 6311,
      "write_ticks" : 0,
      "in_queue" : 6312,
      "util" : 95.257316
    }
  ]
}

fio-3.28-4R5J0001-read-1G-4-1-16K: (groupid=0, jobs=1): err= 0: pid=82580: Mon Jun 23 21:37:40 2025
  read: IOPS=33.0k, BW=515MiB/s (540MB/s)(1024MiB/1988msec)
    slat (nsec): min=2836, max=57641, avg=11180.17, stdev=3947.58
    clat (usec): min=34, max=400, avg=108.58, stdev=39.67
     lat (usec): min=53, max=408, avg=120.07, stdev=39.85
    clat percentiles (usec):
     |  1.00th=[   55],  5.00th=[   58], 10.00th=[   60], 20.00th=[   68],
     | 30.00th=[   93], 40.00th=[  111], 50.00th=[  113], 60.00th=[  117],
     | 70.00th=[  122], 80.00th=[  130], 90.00th=[  137], 95.00th=[  145],
     | 99.00th=[  269], 99.50th=[  281], 99.90th=[  297], 99.95th=[  297],
     | 99.99th=[  314]
   bw (  KiB/s): min=499840, max=542464, per=99.57%, avg=525173.33, stdev=22421.30, samples=3
   iops        : min=31240, max=33904, avg=32823.33, stdev=1401.33, samples=3
  lat (usec)   : 50=0.24%, 100=30.25%, 250=67.03%, 500=2.48%
  cpu          : usr=9.81%, sys=48.01%, ctx=23814, majf=0, minf=27
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=515MiB/s (540MB/s), 515MiB/s-515MiB/s (540MB/s-540MB/s), io=1024MiB (1074MB), run=1988-1988msec

Disk stats (read/write):
  sda: ios=62112/0, merge=0/0, ticks=6311/0, in_queue=6312, util=95.26%